# # ====================== 1. 创建集合 ======================
# s1 = {1, 2, 3, 4}       # 集合1
# s2 = {3, 4, 5, 6}       # 集合2
# print("原始集合 s1:", s1)
# print("原始集合 s2:", s2)
#
# # ====================== 2. 添加元素 add() ======================
# # 添加单个元素，重复添加不会报错（自动去重）
# s1.add(5)
# print("\nadd(5) 后 s1:", s1)  # {1,2,3,4,5}
#
# # ====================== 3. 删除元素 remove() ======================
# # 删除指定元素，元素不存在会报错
# s1.remove(2)
# print("remove(2) 后 s1:", s1)  # {1,3,4,5}
#
# # ====================== 4. 随机删除 pop() ======================
# # 随机删一个元素（集合无序，无法指定）
# pop_item = s1.pop()
# print("pop() 删除的元素:", pop_item)
# print("pop() 后 s1:", s1)
#
# # ====================== 5. 清空集合 clear() ======================
# s1.clear()
# print("clear() 后 s1:", s1)  # 空集合 set()
#
# # ====================== 6. 差集 difference() ======================
# # s2 有、s3 没有的元素
# s2 = {3, 4, 5, 6}
# s3 = {1, 2, 3, 4}
# diff = s2.difference(s3)
# print("\ns2 - s3 差集:", diff)  # {5,6}
#
# # 简写：s2 - s3
# print("简写差集:", s2 - s3)
#
# # ====================== 7. 并集 union() ======================
# # 两个集合所有元素（自动去重）
# union_set = s2.union(s3)
# print("\ns2 和 s3 并集:", union_set)  # {1,2,3,4,5,6}
#
# # 简写：s2 | s3
# print("简写并集:", s2 | s3)
#
# # ====================== 8. 交集 intersection() ======================
# # 两个集合都有的元素
# inter_set = s2.intersection(s3)
# print("\ns2 和 s3 交集:", inter_set)  # {3,4}
#
# # 简写：s2 & s3
# print("简写交集:", s2 & s3)



# 选修足球学生名单
football_set = {"王林", "曾牛", "徐立国", "遁天", "天运子", "韩立", "厉飞雨", "乌丑", "紫灵"}

# 选修篮球学生名单
basketball_set = {"张铁", "墨居仁", "王林", "姜老道", "曾牛", "王蝉", "韩立", "天运子", "李化元", "厉飞雨", "云露"}

# 选修法语学生名单
french_set = {"许木", "王卓", "十三", "虎咆", "姜老道", "天运子", "红蝶", "厉飞雨", "韩立", "曾牛"}

# 选修艺术学生名单
art_set = {"遁天", "天运子", "韩立", "虎咆", "姜老道", "紫灵"}

#1.找出同时选修了法语和艺术的学生
A = french_set.intersection(art_set)
print(A)
#方法二&符号的应用
A = french_set & art_set
print(A)
#2.找出同时选修了所有四门课程的学生
#3.找出选修了足球,但是没有选修篮球的学生
#4,统计每一个学生选修的课程数量